package slimeLand;


public class menu {
    
    public static void Startmenu(){
        System.out.println("-------------------------     몬스터 잡기   ---------------------------");
        System.out.println("-------------------------   캐릭터 선택(번호)  ------------------------");
        System.out.println("------------------   1. 전사 | 2. 마법사 | 3. 종료    -----------------");
        System.out.println("----------------------------------------------------------------------");
        System.out.print("선택:");
    }
    public static void campmenu() {
        System.out.println("-----------------------------  몬스터 잡기  ---------------------------");
        System.out.println("-----------------------------     마을      ---------------------------");
        System.out.println("---------1. 전투시작 |  2. 캐릭터정보 | 3. 상점 | 4. 돌아가기-------");
        System.out.println("-----------------------------------------------------------------------");
        System.out.print("선택:");
    }
    
    public static void Shopmenu() {
        System.out.println("-----------------------------  몬스터잡기  ---------------------------");
        System.out.println("-----------------------------     상점     ---------------------------");
        System.out.println("            *******                    ********                       ");
        System.out.println("             *   *                      *    *                        ");
        System.out.println("            *******                    ********                       ");
        System.out.println("----------------------------------------------------------------------");
        
        
        
        System.out.println("---------1. 힐링포션(50 gold) | 2. 마나포션(50 gold) | 3. 돌아가기-------");
        System.out.println("-----------------------------------------------------------------------");
    }
    
    public static void fightmenu(){
        System.out.println("-----------------------------------------------------------------------");
        System.out.println("---------   1. 기본공격 | 2. 스킬 | 3. 인벤토리 | 4. 도망가기   --------");
    }
    
   
    
   
}


